app/views/users/show.html.erb

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 3]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]
---
          <td>
            <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>