app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]
---
                  <%= link_to books_path, method: :delete do %>
                    ♥<%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 10]]
---
                  <%= link_to books_path, method: :post do %>
                    ♡<%= @book.favorites.count %> いいね

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]
---
            <td>
              <%= link_to "#{book.book_comments.count} コメント", book_path(book.id) %>