app/views/books/show.html.erb

                <%= link_to book_favorites_path(@book), method: :delete do %>
                  ♥<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]

                <%= link_to book_favorites_path(@book), method: :post do %>
                  ♡<%= @book.favorites.count %> いいね
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 9]]

          <td>
            <p>コメント件数: <%= @book.book_comments.count %></p>
---
SELECT "books".* FROM "books"
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 10]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]

      <div>
        <% @book.book_comments.each do |book_comment| %>
---
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 9]]