app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "テスト"], ["body", "テスト2"], ["user_id", 5], ["created_at", "2021-10-26 06:16:41.895547"], ["updated_at", "2021-10-26 06:16:41.895547"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book.id)
      flash[:success] = "新規登録ができました"
    else
      @books = Book.all

SELECT "books".* FROM "books"
---
  def index
    @book = Book.new
    @user = current_user
    @books = Book.all

SELECT "books".* FROM "books"
---
  def show
    @user = current_user
    @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "test1編集"], ["body", "test1編集"], ["updated_at", "2021-10-26 12:29:24.822219"], ["id", 15]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params) != current_user

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 14]]
---
  def destroy
    @book = Book.find(params[:id])
    if @book.user != current_user
      redirect_to  books_path
    else
      @book.destroy