app/controllers/books_controller.rb

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy