app/controllers/users_controller.rb

  def index
    @book = Book.new

    @users = User.all
---
SELECT "users".* FROM "users"

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "tom"], ["profile_image_id", "6bf83c9cff6af3903541fc2f0303bfdf0863df52097998fa71cf512f72c4"], ["introduction", "Hi!"], ["updated_at", "2021-10-27 02:21:04.795564"], ["id", 7]]