app/models/user.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 13], ["followed_id", 13], ["created_at", "2021-11-03 11:09:44.441824"], ["updated_at", "2021-11-03 11:09:44.441824"]]
---
  def follow(user_id)
    unless self.id == user_id.to_i
      self.relationships.create(followed_id: user_id) #self = current_userだけに限定しないため・書く必要はないが書かない場合も実際は隠れている

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 12]]
---
  def unfollow(user_id)
    relationships.find_by(followed_id: user_id).destroy